// Записати масив студентів у state компонента App, використовуючи useState. Саме з цього state дані повинні передаватися далі у дочірні компоненти.

// Створити перевикористовуваний компонент Button, який мовинен отртмувати текстовий контент та обродник події кліку як пропси.

// У кожному елементі списку потрібно додати кнопку "View profile". При натисканні на кнопку має викликатися обробник події onClick, а у консолі браузера повинен виводитись ідентифікатор користувача.

// Додати до компонента StudentItem кнопку Delete, при натисканні на яку студент з переліку має видалятись.

// Додати до компонента StudentItem кнопку Change online status, при натисканні на яку статус студента має змінюватись на протилежний.

// Створити всередині компонента StudentItem кнопку "Show address", при натисканні на яку має відображатись адреса студента (початково ці дані повинні бути приховані), а текстовй контент кнопки має змінюватись на "Hide address" (при натисканні алреса має приховуватись).
