// Реалізувати запит на додавання книги (має викликатись при сабміті форми AddBookForm)
// Додати компоненту BookItem кнопку видалення, при натисканні на яку елемент має видалятись (реалізувати відповідний запит)
// Реалізувати запит на додавання юзера (має викликатись при сабміті форми UserForm)
// Додати компоненту UserItem кнопку видалення, при натисканні на яку елемент має видалятись (реалізувати відповідний запит)

// Додатково
// Додати компоненту UserItem параграф, в якому виводити інформацію про те, чи користувач онлайн.
// Додати компоненту UserItem кнопку Toggle status, ми натисанні на яку на бекенд має відправлятись put-запит для зміни статусу на протилежний.
